P(Мужчина до 25|Мужчина and Переход) = 0.1
P(Мужчина and Переход|Мужчина до 25) = P(Мужчина до 25|Мужчина and Переход) * P(Мужчина and Переход) / P(Мужчина до 25) =
  P(Мужчина до 25|Мужчина and Переход) * P(Мужчина|Переход) * P(Переход) / P(Мужчина до 25) =
  0.1 * 0.46 * 0.05 / (0.6 * 0.46)
P(Мужчина до 25) = 0.6 * 0.46
P(Мужчина|Переход) = P(Мужчина and Переход) / P(Переход)
P(Мужчина and Переход) = P(Мужчина|Переход) * P(Переход)
P(Переход|Мужчина до 25) = P(Мужчина до 25|Переход) * P(Переход) / P(Мужчина до 25)